#### Pandas is a powerful library in data science,where we can convert raw data to understandable information. It is built on top of numpy,and contains more functionalities than numpy. It is best tool for handling real world messy data.

* Pandas gives us 2 powerful data structures-series,dataframe. Internal alignment of data is a specific feature of this tool

In [1]:
import numpy as np
import pandas as pd

In [2]:
d=[40,20,60,80,12]
ser1=pd.Series(d)
print(ser1)
print(type(ser1))

0    40
1    20
2    60
3    80
4    12
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
###we can give our own indexes:
sales=[500,550,675,486,682]
days=['Monday','Tuesday','Wednesday','Thursday','Friday']

ser2=pd.Series(sales,index=days)
ser2

Monday       500
Tuesday      550
Wednesday    675
Thursday     486
Friday       682
dtype: int64

In [4]:
###Q) What are the sales recorded on thurday?

thurs_sales=ser2['Thursday']
print('Sales on Thursday:',thurs_sales)

Sales on Thursday: 486

In [5]:
sales2=np.array([500,550,675,486,682]) ###create a series from values stored in an array
ser3=pd.Series(sales2)
ser3

0    500
1    550
2    675
3    486
4    682
dtype: int32

In [6]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser4=pd.Series(d2)
ser4

Name    Python
id       10875
3        Three
dtype: object

In [7]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser5=pd.Series(d2,index=['a','id','c'])
ser5

a       NaN
id    10875
c       NaN
dtype: object

In [8]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3)
df0

  Name  Experience  Salary
0    A         1.2   40000
1    B         2.8   55000
2    C         5.5   96000
3    D         3.5   60000

In [9]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3,index=[1,2,3,4])
df0

  Name  Experience  Salary
1    A         1.2   40000
2    B         2.8   55000
3    C         5.5   96000
4    D         3.5   60000

In [10]:
df0.iloc[2,1] ###iloc=index location.

5.5

In [11]:
###iloc is a function which we use to slice dataframes using the index position of the value we want to retrieve.

In [12]:
####loc function is used to slice dataframes with the row,column names(labels)

In [13]:
df0.at[3,'Experience']  #to get a single value from the dataframe

5.5

In [14]:
df0.loc[3,'Experience']

5.5

In [17]:
df0

  Name  Experience  Salary
1    A         1.2   40000
2    B         2.8   55000
3    C         5.5   96000
4    D         3.5   60000

In [15]:
df0.loc[2:3]

  Name  Experience  Salary
2    B         2.8   55000
3    C         5.5   96000

In [22]:
df0.iloc[2:3]

  Name  Experience  Salary
3    C         5.5   96000

In [18]:
###get the value 55,000
df0.iloc[1,2]

55000

In [20]:
df0.loc[2,'Salary']

55000

#### Text data Operations:

In [23]:
df1=pd.DataFrame({'column':['Hello','World','Python','Data Science']})
df1

         column
0         Hello
1         World
2        Python
3  Data Science

In [24]:
###i want to find out the length of each string value mapped to 'column' and i will store the values in a 
### separate variable called length.
df1['Length']=df1['column'].str.len()
print('Length of each string value mapped to column is:')
print(df1)

Length of each string value mapped to column is:
         column  Length
0         Hello       5
1         World       5
2        Python       6
3  Data Science      12

In [25]:
## to convert each string value to uppercase or lowercase we use the upper() or lower() function:
df1['Upper']=df1['column'].str.upper()
df1

         column  Length         Upper
0         Hello       5         HELLO
1         World       5         WORLD
2        Python       6        PYTHON
3  Data Science      12  DATA SCIENCE

In [26]:
###iterating over rows:
df2=pd.DataFrame({'col1':[1,2,3],'col2':['A','B','C']})
df2

   col1 col2
0     1    A
1     2    B
2     3    C

In [27]:
for index,row in df2.iterrows():
    print(index,row)

0 col1    1
col2    A
Name: 0, dtype: object
1 col1    2
col2    B
Name: 1, dtype: object
2 col1    3
col2    C
Name: 2, dtype: object

In [28]:
###Q) change the row index from 0 to 10 and 2 to 25 in the dataframe df2?

In [29]:
### iterating over a 1D series:
series1=pd.Series([10,20,30],name='values')
series1

0    10
1    20
2    30
Name: values, dtype: int64

In [57]:
series2=pd.Series([10,20,30])
series2

0    10
1    20
2    30
dtype: int64

In [30]:
for index,value in series1.iteritems():
    print(f"index:{index},Value{value}")

index:0,Value10
index:1,Value20
index:2,Value30

C:\Users\Admin\AppData\Local\Temp\ipykernel_14996\2901372315.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for index,value in series1.iteritems():

In [58]:
for index in series2.items():
    print(index)

(0, 10)
(1, 20)
(2, 30)

In [34]:
###apply method is used to apply a function on a single row or column in a dataframe
df3=pd.DataFrame({'Old Column':[10,20,30]})
df3

   Old Column
0          10
1          20
2          30

In [36]:
df3['ModCol']=df3['Old Column'].apply(lambda x:x*x)
df3

   Old Column  ModCol
0          10     100
1          20     400
2          30     900

In [37]:
d4={'Name':pd.Series(['Tom','Jyoti','Maria','Bill']),
    'Language': pd.Series(['English','Japanese','French','Hindi']),
    'Marks':pd.Series([56,67,88,91])}

df4=pd.DataFrame(d4)

In [38]:
df4

    Name  Language  Marks
0    Tom   English     56
1  Jyoti  Japanese     67
2  Maria    French     88
3   Bill     Hindi     91

In [39]:
d4

{'Name': 0      Tom
 1    Jyoti
 2    Maria
 3     Bill
 dtype: object,
 'Language': 0     English
 1    Japanese
 2      French
 3       Hindi
 dtype: object,
 'Marks': 0    56
 1    67
 2    88
 3    91
 dtype: int64}

##### Sorting:

In [40]:
df5=pd.DataFrame({'Name':['Alice','Bob','Charlie'],
                  'Age':[25,22,30],
                  'Salary':[50000,60000,75000]})
df5

      Name  Age  Salary
0    Alice   25   50000
1      Bob   22   60000
2  Charlie   30   75000

In [42]:
df5_sorted=df5.sort_values(by='Age')
df5_sorted

      Name  Age  Salary
1      Bob   22   60000
0    Alice   25   50000
2  Charlie   30   75000

In [43]:
df5_multisort=df5.sort_values(by=['Age','Salary'],ascending=[True,False])
df5_multisort

      Name  Age  Salary
1      Bob   22   60000
0    Alice   25   50000
2  Charlie   30   75000

In [44]:
##sorting of row indexes:
sorted_indexes=df5_multisort.sort_index(ascending=0)
sorted_indexes

      Name  Age  Salary
2  Charlie   30   75000
1      Bob   22   60000
0    Alice   25   50000

In [46]:
df5_multisort = df5.sort_values(by = ['Age', 'Salary'], ascending = [True, False]).sort_index()
df5_multisort

      Name  Age  Salary
0    Alice   25   50000
1      Bob   22   60000
2  Charlie   30   75000

In [47]:
df7=pd.DataFrame({'Column_name':[5,10,8],
                 'column1':[10,20,30],
                 'column2':[100,200,300],
                 'Another_column':[25,35,45]})
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [48]:
#Q) access the column 'column_name' from df7

In [60]:
print(df7['Column_name'])

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [61]:
df7.iloc[:,0]

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [62]:
df7.Column_name

0     5
1    10
2     8
Name: Column_name, dtype: int64

In [49]:
#Q) access multiple columns 'column1' and 'column2' from df7

In [63]:
print(df7[['column1','column2']])

   column1  column2
0       10      100
1       20      200
2       30      300

In [64]:
df7.iloc[:,1:3]

   column1  column2
0       10      100
1       20      200
2       30      300

In [67]:
df7.loc[:,['column1','column2']]

   column1  column2
0       10      100
1       20      200
2       30      300

In [50]:
#Q) access the value 45 from df7

In [69]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [70]:
df7.iloc[2,3]

45

In [71]:
df7.loc[2,'Another_column']

45

In [51]:
#Q) access the value 35

In [72]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [73]:
df7.iloc[1,3]

35

In [75]:
df7.iat[1,3] ##iat and iloc are same,use either

35

In [74]:
df7.loc[1,'Another_column']

35

In [77]:
df7.at[1,'Another_column'] ## at and loc is same,use either

35

In [82]:
#Q)slice out all values greater than 10 of column1  and print out only Another_column and Column_name values
# which satisfy the condition

In [78]:
df7

   Column_name  column1  column2  Another_column
0            5       10      100              25
1           10       20      200              35
2            8       30      300              45

In [80]:
df7[df7['column1']>10]

   Column_name  column1  column2  Another_column
1           10       20      200              35
2            8       30      300              45

In [81]:
filtered_df=df7[df7['column1']>10][['Another_column','Column_name']]
filtered_df

   Another_column  Column_name
1              35           10
2              45            8

In [53]:
#Q)iterate over all rows in df4 and print the results

In [84]:
df4

    Name  Language  Marks
0    Tom   English     56
1  Jyoti  Japanese     67
2  Maria    French     88
3   Bill     Hindi     91

In [83]:
for i,j in df4.iterrows():
    print(i,j)
    print()

0 Name            Tom
Language    English
Marks            56
Name: 0, dtype: object

1 Name           Jyoti
Language    Japanese
Marks             67
Name: 1, dtype: object

2 Name         Maria
Language    French
Marks           88
Name: 2, dtype: object

3 Name         Bill
Language    Hindi
Marks          91
Name: 3, dtype: object

In [54]:
#Q)get the values associated with 'Maria' in df4

In [87]:
for index,value in df4.iterrows():
    if('Maria' in value['Name']):
        print(value)

Name         Maria
Language    French
Marks           88
Name: 2, dtype: object

In [88]:
print(df4[df4['Name'] == 'Maria'])

    Name Language  Marks
2  Maria   French     88

In [55]:
#Q) insert a new column called 'city' in df4 and assign values Delhi,Mumbai,Bengaluru,Kolkata to the variable.

In [89]:
df4['city']=['Delhi','Mumbai','Bengaluru','Kolkata']
df4

    Name  Language  Marks       city
0    Tom   English     56      Delhi
1  Jyoti  Japanese     67     Mumbai
2  Maria    French     88  Bengaluru
3   Bill     Hindi     91    Kolkata

In [59]:
#Q) iterate over the columns in df4

In [90]:
df4.columns  #gives you the list of all columns in the df

Index(['Name', 'Language', 'Marks', 'city'], dtype='object')

In [93]:
for col in df4.columns:
    print(df4[col].values)

['Tom' 'Jyoti' 'Maria' 'Bill']
['English' 'Japanese' 'French' 'Hindi']
[56 67 88 91]
['Delhi' 'Mumbai' 'Bengaluru' 'Kolkata']

In [94]:
for i, j in df4.items():
    print(i, j)

Name 0      Tom
1    Jyoti
2    Maria
3     Bill
Name: Name, dtype: object
Language 0     English
1    Japanese
2      French
3       Hindi
Name: Language, dtype: object
Marks 0    56
1    67
2    88
3    91
Name: Marks, dtype: int64
city 0        Delhi
1       Mumbai
2    Bengaluru
3      Kolkata
Name: city, dtype: object